// /** @file
// Vtf0SecCore Localized Abstract and Description Content
//
// Copyright (c) 2012 - 2014, Intel Corporation. All rights reserved.<BR>
//
// This file contains an 'Intel Pre-EFI Module' and is licensed
// for Intel CPUs and Chipsets under the terms of your license
// agreement with Intel or your vendor.  This file may be
// modified by the user, subject to additional terms of the
// license agreement
//
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
//
// **/

#string STR_MODULE_ABSTRACT
#language en-US
"Vft0SecCore module: SEC Core"

#string STR_MODULE_DESCRIPTION
#language en-US
"This is the first module taking control of the platform upon power-on/reset. "
"It implements the first phase of the security phase. The entry point function is "
"_ModuleEntryPoint in PlatformSecLib. This module is expected to co-work "
"with the reset vector binary located in UefiCpuPkg\\ResetVector\\Vft0. The "
"VTF0 binary transitions to IA32 flat mode, then locates and jumps to this "
"module's entry point function."


